## Koşullu Eleman İşlemleri

In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(3,30,(10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     3    15    26
1     3    11     7
2    29     3    18
3    17    24    14
4    26     3    16
5     8    28    23
6    12    24    27
7     6    27     7
8    28    22    21
9     9    24    24

In [2]:
df["var1"]

0     3
1     3
2    29
3    17
4    26
5     8
6    12
7     6
8    28
9     9
Name: var1, dtype: int32

In [3]:
df[0:2]

   var1  var2  var3
0     3    15    26
1     3    11     7

In [4]:
df[0:2]["var1"]

0    3
1    3
Name: var1, dtype: int32

In [5]:
df[0:2][["var1","var2"]]

   var1  var2
0     3    15
1     3    11

In [6]:
df

   var1  var2  var3
0     3    15    26
1     3    11     7
2    29     3    18
3    17    24    14
4    26     3    16
5     8    28    23
6    12    24    27
7     6    27     7
8    28    22    21
9     9    24    24

In [7]:
df.var1

0     3
1     3
2    29
3    17
4    26
5     8
6    12
7     6
8    28
9     9
Name: var1, dtype: int32

In [8]:
df[df.var1 > 15]

   var1  var2  var3
2    29     3    18
3    17    24    14
4    26     3    16
8    28    22    21

In [9]:
df[df.var1 > 15]["var1"]

2    29
3    17
4    26
8    28
Name: var1, dtype: int32

In [15]:
df[(df.var1 > 10) & (df.var3 < 20)]

   var1  var2  var3
2    29     3    18
3    17    24    14
4    26     3    16

In [19]:
# df[df.var1 > 10, "var1"]  hata verir

In [21]:
# df[df.var1 > 10, ["var1","var2"]]  hata verir

In [22]:
df.loc[df.var1 > 10, ["var1","var2"]]

   var1  var2
2    29     3
3    17    24
4    26     3
6    12    24
8    28    22

In [23]:
df[df.var1 > 10][["var1","var2"]]

   var1  var2
2    29     3
3    17    24
4    26     3
6    12    24
8    28    22